Update Ref Arch docs with Gitaly Cluster
